genestealer/everblu-meters-esp8266-improved/src/main.cpp
// Read success/failure metrics
unsigned long totalReadAttempts = 0;
unsigned long successfulReads = 0;
unsigned long failedReads = 0;
const char *lastErrorMessage = "None";

// CC1101 radio connection state
bool cc1101RadioConnected = false; // Tracks whether the radio is detected and initialized

// Frequency offset storage
#define EEPROM_SIZE 64
#define FREQ_OFFSET_ADDR 0
#define FREQ_OFFSET_MAGIC 0xABCD // Magic number to verify valid data
float storedFrequencyOffset = 0.0;
bool autoScanEnabled = (AUTO_SCAN_ENABLED != 0);                     // Enable automatic scan on first boot if no offset found
bool autoScanOnFailureEnabled = (AUTO_SCAN_ON_FAILURE_ENABLED != 0); // Enable automatic scan after max retries reached
int successfulReadsBeforeAdapt = 0;              // Track successful reads for adaptive tuning
float cumulativeFreqError = 0.0;                 // Accumulate FREQEST readings for adaptive adjustment

// Define the adaptive frequency tracking threshold if missing from private.h
// Controls how many successful reads trigger a frequency adjustment
// Default: 1 (adjust after every read, ideal for once-per-day schedules)
// Increase to 5-10 for more stable reading conditions
#ifndef ADAPTIVE_THRESHOLD
#define ADAPTIVE_THRESHOLD 1
#endif
const int ADAPT_THRESHOLD = ADAPTIVE_THRESHOLD;

#if defined(ESP32)
Preferences preferences;
#endif

// ============================================================================
// Frequency Management API
// ============================================================================

/**
 * @brief Save frequency offset to persistent storage
 *
 * Stores the frequency offset value to EEPROM (ESP8266) or Preferences (ESP32)
 * with a magic number for validation. This offset is applied on next boot.
 *
 * @param offset Frequency offset in MHz to be added to base frequency
 */
void saveFrequencyOffset(float offset);

/**
 * @brief Load frequency offset from persistent storage
 *
 * Retrieves previously saved frequency offset from EEPROM (ESP8266) or
 * Preferences (ESP32). Validates data integrity using magic number.
 *
 * @return Frequency offset in MHz, or 0.0 if no valid data found
 */
float loadFrequencyOffset();

/**
 * @brief Perform a Deep frequency scan
 *
 * Scans +-150 kHz (default) around the configured frequency in fine 2.5 kHz steps,
 * mapping the response window then zooming to the exact carrier centre.
 * Also used on first boot when no stored offset exists.
 *
 * Saves discovered offset to persistent storage on success.
 */
void performDeepFrequencyScan(float scanRangeMHz = 0.150f, float scanStepMHz = 0.0025f);

// ============================================================================
// Frequency Management Implementation
// ============================================================================

/**
 * @brief Adaptive frequency tracking using FREQEST
 *
 * Accumulates frequency offset estimates from successful reads and gradually
 * adjusts radio frequency to track meter drift. Uses statistical averaging
 * (ADAPT_THRESHOLD reads) to avoid over-correction on noise.
 *
 * FREQEST register provides frequency error estimate in 2's complement format,
 * with resolution ~1.59 kHz per LSB (26 MHz crystal).
 *
 * Adjustment logic:
 * - Accumulate FREQEST over multiple reads
 * - After threshold reads, calculate average error
 * - If average > 2 kHz, apply 50% correction to avoid oscillation
 * - Save new offset to persistent storage
 * - Reinitialize CC1101 with corrected frequency
 *
 * @param freqest Frequency offset estimate from CC1101 FREQEST register (-128 to +127)
 */
void adaptiveFrequencyTracking(int8_t freqest);

// Secrets pulled from private.h file
// Note: MQTT Client ID is made unique per device by appending the meter serial number
// This prevents multiple devices from having the same client ID and causing MQTT connection conflicts

static const char *buildMqttClientIdWithSerial()
{
  static char client_id[64] = {};
  uint8_t year = 0;
  uint32_t serial = 0;
  if (everblu::core::parseMeterCode(METER_CODE, &year, &serial))
  {
    snprintf(client_id, sizeof(client_id), "%s-%lu", SECRET_MQTT_CLIENT_ID, (unsigned long)serial);
  }
  else
  {
    // Keep startup resilient so validation can print a clear error afterward.
    snprintf(client_id, sizeof(client_id), "%s-%s", SECRET_MQTT_CLIENT_ID, METER_CODE);
  }
  return client_id;
}

const char *MQTT_CLIENT_ID_WITH_SERIAL = buildMqttClientIdWithSerial();

EspMQTTClient mqtt(
    SECRET_WIFI_SSID,           // Your Wifi SSID
    SECRET_WIFI_PASSWORD,       // Your WiFi key
    SECRET_MQTT_SERVER,         // MQTT Broker server ip
    SECRET_MQTT_USERNAME,       // MQTT Username Can be omitted if not needed
    SECRET_MQTT_PASSWORD,       // MQTT Password Can be omitted if not needed
    MQTT_CLIENT_ID_WITH_SERIAL, // MQTT Client name: uniquely identifies device by appending meter serial
    1883                        // MQTT Broker server port
);

// Base MQTT topic prefix for all EverBlu Cyble entities
// Centralising this avoids repeating "everblu/cyble/" all over the code.
// mqttBaseTopic is populated during setup() after parsing METER_CODE.

const char jsonTemplate[] = "{ "
                            "\"liters\": %d, "
                            "\"counter\" : %d, "
                            "\"battery\" : %d, "
                            "\"rssi\" : %d, "
                            "\"timestamp\" : \"%s\" }";

// Define the default maximum retries if missing from the private.h file
#ifndef MAX_RETRIES
#define MAX_RETRIES 5 // Default: 5 retry attempts before cooldown
#endif

int _retry = 0;
const int max_retries = MAX_RETRIES;          // Maximum number of retry attempts (configurable in private.h)
unsigned long lastFailedAttempt = 0;          // Timestamp of last failed attempt
const unsigned long RETRY_COOLDOWN = 3600000; // 1 hour cooldown in milliseconds
bool g_autoScanAfterFailureDone = false;      // Guards the failure-recovery frequency scan to once per failure streak

