genestealer/everblu-meters-esp8266-improved/src/main.cpp
// Global variable to store the reading schedule (default from private.h)
const char *readingSchedule = DEFAULT_READING_SCHEDULE;

// Helper variables for generating serial-prefixed MQTT topics and entity IDs.
// They are filled by parseMeterCode() in setup() before last-will configuration.
// Format: everblu/cyble/{serial} (or everblu/cyble if meter prefix is disabled)
// Compile-time check: Ensure METER_CODE is defined
#if !defined(METER_CODE)
#error "METER_CODE must be defined in private.h"
#endif

// Define meter prefix option if not defined in private.h (default to enabled)
#ifndef ENABLE_METER_PREFIX_IN_ENTITY_IDS
#define ENABLE_METER_PREFIX_IN_ENTITY_IDS 1
#endif

// Define Home Assistant MQTT discovery option if not defined in private.h (default to enabled)
#ifndef ENABLE_HA_DISCOVERY
#define ENABLE_HA_DISCOVERY 1
#endif

// Buffer sizes for MQTT topics are intentionally conservative for future-proofing.
// Current worst-case payloads are significantly smaller than these buffers.
// Parsed at runtime from METER_CODE by parseMeterCode() called at the start of setup()
static uint8_t g_meterYear = 0;
static uint32_t g_meterSerial = 0;
char meterSerialStr[16] = {}; // filled by parseMeterCode()
#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
char mqttBaseTopic[64] = {}; // filled by parseMeterCode()
char mqttLwtTopic[80] = {};  // filled by parseMeterCode()
#else
char mqttBaseTopic[64] = "everblu/cyble";       // Base MQTT topic without meter serial
char mqttLwtTopic[80] = "everblu/cyble/status"; // LWT status topic without serial number
#endif

/**
 * Parse METER_CODE ("YY-SSSSSSS" or "YY-SSSSSSS-NNN") into g_meterYear,
 * g_meterSerial, and
 * the MQTT topic buffers.  Called once at the very start of setup().
 */
static void parseMeterCode()
{
  if (!everblu::core::parseMeterCode(METER_CODE, &g_meterYear, &g_meterSerial))
  {
    Serial.println("[ERROR] Invalid METER_CODE - expected YY-serial or YY-serial-NNN (with dashes)");
    return;
  }

  snprintf(meterSerialStr, sizeof(meterSerialStr), "%lu", (unsigned long)g_meterSerial);
#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
  snprintf(mqttBaseTopic, sizeof(mqttBaseTopic), "everblu/cyble/%lu", (unsigned long)g_meterSerial);
  snprintf(mqttLwtTopic, sizeof(mqttLwtTopic), "everblu/cyble/%lu/status", (unsigned long)g_meterSerial);
#endif
}

// Standard buffer size for constructing MQTT topic strings
// Calculation: mqttBaseTopic (max 63) + longest suffix "/wifi_signal_percentage" (24) + null (1) = 88 bytes
// Buffer size: 128 bytes provides 1.45x safety margin for topic construction
#define MQTT_TOPIC_BUFFER_SIZE 128

// ============================================================================
// Meter Type Configuration
// ============================================================================

// Define meter type if not defined in private.h (default to water)
#ifndef METER_TYPE
#define METER_TYPE "water"
#endif

// Meter-specific configuration based on METER_TYPE
// These variables control the Home Assistant device class, icon, and unit of measurement
const char *meterDeviceClass;
const char *meterIcon;
const char *meterUnit;
// Compile-time string equality helper to avoid runtime strcmp for meter type
constexpr bool strEq(const char *a, const char *b)
{
  return (*a == *b) && (*a == '\0' || strEq(a + 1, b + 1));
}
constexpr bool meterIsGas = strEq(METER_TYPE, "gas");

// Initialize meter configuration
static void initMeterTypeConfig()
{
  if (meterIsGas)
  {
    meterDeviceClass = "gas";
    meterIcon = "mdi:meter-gas";
    meterUnit = "m³";
    Serial.println("[STATUS] Meter type: GAS (readings in m³)");
  }
  else
  {
    meterDeviceClass = "water";
    meterIcon = "mdi:water";
    meterUnit = "L";
    Serial.println("[STATUS] Meter type: WATER (readings in L)");
  }
}

// ============================================================================
// Schedule Validation API
// ============================================================================

// Note: isValidReadingSchedule() is now in utils.h/cpp

/**
 * @brief Validate and correct reading schedule
 *
 * Checks if current reading schedule is valid. If invalid, falls back
 * to safe default ("Monday-Friday") and logs a warning.
 */
static void validateReadingSchedule()
{
  if (!isValidReadingSchedule(readingSchedule))
  {
    Serial.printf("[WARNING] Invalid reading schedule '%s'. Falling back to 'Monday-Friday'.\n", readingSchedule);
    readingSchedule = "Monday-Friday";
  }
}

/**
 * @brief Update cached schedule times based on a local (UTC+offset) time
 */
static void updateResolvedScheduleFromLocal(int hourLocal, int minuteLocal)
{
  int normalizedHour = constrain(hourLocal, 0, 23);
  int normalizedMinute = constrain(minuteLocal, 0, 59);

  g_readHourLocal = normalizedHour;
  g_readMinuteLocal = normalizedMinute;

  int totalLocalMin = normalizedHour * 60 + normalizedMinute;
  int utcMin = (totalLocalMin - TIMEZONE_OFFSET_MINUTES) % (24 * 60);
  if (utcMin < 0)
    utcMin += 24 * 60;
  g_readHourUtc = utcMin / 60;
  g_readMinuteUtc = utcMin % 60;
}

/**
 * @brief Update cached schedule times based on a UTC time
 */
static void updateResolvedScheduleFromUtc(int hourUtc, int minuteUtc)
{
  int normalizedHour = constrain(hourUtc, 0, 23);
  int normalizedMinute = constrain(minuteUtc, 0, 59);

  g_readHourUtc = normalizedHour;
  g_readMinuteUtc = normalizedMinute;

  int totalUtcMin = normalizedHour * 60 + normalizedMinute;
  int localMin = (totalUtcMin + TIMEZONE_OFFSET_MINUTES) % (24 * 60);
  if (localMin < 0)
    localMin += 24 * 60;
  g_readHourLocal = localMin / 60;
  g_readMinuteLocal = localMin % 60;
}

// Note: isReadingDay() is now in ScheduleManager class

// ============================================================================
// Signal Quality Conversion API
// ============================================================================

/**
 * @brief Convert WiFi RSSI to percentage
 *
 * Maps WiFi RSSI value to 0-100% scale for user-friendly display.
 * Clamps input to reasonable range (-100 to -50 dBm).
 *
 * @param rssi WiFi RSSI in dBm (typically -100 to -50)
 * @return Signal strength as percentage (0-100)
 */
int calculateWiFiSignalStrengthPercentage(int rssi)
{
  int strength = constrain(rssi, -100, -50); // Clamp RSSI to a reasonable range
  return map(strength, -100, -50, 0, 100);   // Map RSSI to percentage (0-100%)
}

