genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Publish CC1101 radio availability status for button enable/disable
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_availability", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "online" : "offline", true);
  delay(5);

  // Publish initial diagnostic metrics (using char buffers instead of String)
  char metricBuffer[16];

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "Idle" : "unavailable", true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/total_attempts", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/successful_reads", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", failedReads);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/failed_reads", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/last_error", mqttBaseTopic);
  mqtt.publish(topicBuffer, lastErrorMessage, true);
  delay(5);

  char freqBuffer[16];
  snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", storedFrequencyOffset * 1000.0); // Convert MHz to kHz
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, true);
  delay(5);

  Serial.println("[MQTT] MQTT config sent");

  // Publish initial Wi-Fi details
  publishWifiDetails();

  // Publish once the meter settings as set in the softeware
  publishMeterSettings();

  // Turn off LED to show everything is setup
  digitalWrite(LED_BUILTIN, HIGH); // turned off

  Serial.println("[STATUS] Setup done");
  Serial.println("================================\n");

  onScheduled();
}

// Function: saveFrequencyOffset
// Description: Saves the frequency offset to persistent storage (EEPROM for ESP8266, Preferences for ESP32)
void saveFrequencyOffset(float offset)
{
#if defined(ESP8266)
  // ESP8266: Use EEPROM
  uint16_t magic = FREQ_OFFSET_MAGIC;
  EEPROM.put(FREQ_OFFSET_ADDR, magic);
  EEPROM.put(FREQ_OFFSET_ADDR + 2, offset);
  EEPROM.commit();
  Serial.printf("[FREQ] Frequency offset %.6f MHz saved to EEPROM\n", offset);
#elif defined(ESP32)
  // ESP32: Use Preferences
  preferences.begin("everblu", false);
  preferences.putFloat("freq_offset", offset);
  preferences.end();
  Serial.printf("[FREQ] Frequency offset %.6f MHz saved to Preferences\n", offset);
#endif
  storedFrequencyOffset = offset;
}

// Function: loadFrequencyOffset
// Description: Loads the frequency offset from persistent storage, returns 0.0 if not found or invalid
float loadFrequencyOffset()
{
#if defined(ESP8266)
  // ESP8266: Use EEPROM
  uint16_t magic = 0;
  EEPROM.get(FREQ_OFFSET_ADDR, magic);
  if (magic == FREQ_OFFSET_MAGIC)
  {
    float offset = 0.0;
    EEPROM.get(FREQ_OFFSET_ADDR + 2, offset);
    // Sanity check: offset should be reasonable (within ±0.1 MHz)
    if (offset >= -0.1 && offset <= 0.1)
    {
      Serial.printf("[FREQ] Loaded frequency offset %.6f MHz from EEPROM\n", offset);
      return offset;
    }
    else
    {
      Serial.printf("[FREQ] Invalid frequency offset %.6f MHz in EEPROM, using 0.0\n", offset);
    }
  }
  else
  {
    Serial.println("[FREQ] No valid frequency offset found in EEPROM");
  }
#elif defined(ESP32)
  // ESP32: Use Preferences
  preferences.begin("everblu", true); // Read-only
  if (preferences.isKey("freq_offset"))
  {
    float offset = preferences.getFloat("freq_offset", 0.0);
    preferences.end();
    // Sanity check: offset should be reasonable (within ±0.1 MHz)
    if (offset >= -0.1 && offset <= 0.1)
    {
      Serial.printf("[FREQ] Loaded frequency offset %.6f MHz from Preferences\n", offset);
      return offset;
    }
    else
    {
      Serial.printf("[FREQ] Invalid frequency offset %.6f MHz in Preferences, using 0.0\n", offset);
    }
  }
  else
  {
    Serial.println("[FREQ] No frequency offset found in Preferences");
    preferences.end();
  }
#endif
  return 0.0;
}

// Function: performDeepFrequencyScan
// Description: Performs a thorough sweep across ±150 kHz around the configured frequency in fine
//              2.5 kHz steps, mapping the response window then zooming to the exact carrier centre.
//              Also used on first boot to find the meter frequency automatically.
void performDeepFrequencyScan(float scanRangeMHz, float scanStepMHz)
{
  Serial.println("[FREQ] Performing Deep frequency scan...");
  Serial.println("[FREQ] [NOTE] Wi-Fi/MQTT connections may temporarily drop and reconnect while the scan is running. This is expected.");

  // Suppress the verbose per-attempt radio/meter read logging for the whole
  // scan. Each frequency step performs a full read sequence whose detailed
  // output is irrelevant noise here; high-level scan progress messages remain.
  EchoDebugQuietGuard quietGuard;

  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Frequency Scanning", true);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Performing Deep frequency scan", true);

  float baseFreq = FREQUENCY;
  // Phase 1: window discovery — continue past first hit until MISS_TOLERANCE
  // consecutive misses, mapping start and end of the carrier response band.
  float firstHitFreq = -1.0f;
  float lastHitFreq  = -1.0f;
  int   bestRSSI = -120;
  int   consecutiveMisses = 0;
  const int MISS_TOLERANCE = 5;

  float scanStart = baseFreq - scanRangeMHz;
  float scanEnd = baseFreq + scanRangeMHz;
  float scanStep = scanStepMHz;

  int deepStepCount = (int)roundf((scanEnd - scanStart) / scanStep) + 1;
  int deepEstSecs = deepStepCount * 3; // ~3 s per step (full radio TX+RX cycle)
  Serial.printf("[FREQ] Deep scan from %.6f to %.6f MHz (%d steps, ~%d s / ~%d min)\n",
                scanStart, scanEnd, deepStepCount, deepEstSecs, (deepEstSecs + 30) / 60);

  for (float freq = scanStart; freq <= scanEnd; freq += scanStep)
  {
    FEED_WDT(); // Feed watchdog for each frequency step

    // Check if CC1101 radio initialization succeeds before attempting communication
    if (!cc1101_init(freq))
    {
      Serial.println("[FREQ] CC1101 radio not responding - aborting Deep scan");
      Serial.println("[FREQ] Check: 1) Wiring connections 2) 3.3V power supply 3) SPI pins");
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "ERROR: CC1101 radio not responding - cannot scan", true);
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Error", true);
      return; // Exit the scan immediately instead of continuing indefinitely
    }

    delay(100); // Longer delay for frequency to settle during Deep scan

    struct tmeter_data test_data = get_meter_data();

