genestealer/everblu-meters-esp8266-improved/src/main.cpp
    Serial.printf("[FREQ] Freq %.6f MHz: RSSI=%d dBm, reads=%d\n", freq, test_data.rssi_dbm, test_data.reads_counter);

    if (test_data.reads_counter > 0)
    {
      if (firstHitFreq < 0.0f)
      {
        firstHitFreq = freq;
        Serial.printf("[FREQ] Window start: %.6f MHz\n", freq);
      }
      lastHitFreq = freq;
      if (test_data.rssi_dbm > bestRSSI) bestRSSI = test_data.rssi_dbm;
      consecutiveMisses = 0;
    }
    else if (firstHitFreq >= 0.0f)
    {
      if (++consecutiveMisses >= MISS_TOLERANCE)
      {
        Serial.printf("[FREQ] Window end: %.6f MHz (%d consecutive misses after last hit)\n",
                      lastHitFreq, consecutiveMisses);
        break;
      }
    }

    // Drain the WiFi serial ring buffer so remote logs stream live during the
    // scan instead of all arriving at once after it completes.
    wifiSerialLoop();
  }

  if (firstHitFreq >= 0.0f)
  {
    float windowMidFreq = (firstHitFreq + lastHitFreq) * 0.5f;
    float windowWidthKHz = (lastHitFreq - firstHitFreq) * 1000.0f;
    Serial.printf("[FREQ] Window: %.6f - %.6f MHz (%.2f kHz wide), midpoint %.6f MHz\n",
                  firstHitFreq, lastHitFreq, windowWidthKHz, windowMidFreq);

    float bestFreq = windowMidFreq;

    // Phase 2: zoom scan across the full discovered window with 4x finer steps.
    // Always runs — even when Phase 1 found only a single point, that hit may be
    // on the edge of the response band; finer steps can locate the true centre.
    // Falls back to windowMidFreq (= firstHitFreq for single-point windows) if
    // all zoom steps miss (FREQEST adaptive tracking will then refine further).
    float zoomStart = firstHitFreq - scanStep;
    float zoomEnd   = lastHitFreq  + scanStep;
    // CC1101 minimum frequency step = Fxosc / 2^16 = 26 MHz / 65536 ≈ 397 Hz.
    // Steps finer than this round to the same register value, silently retesting
    // the same physical frequency. Clamp to at least 1 register step.
    const float CC1101_MIN_STEP_MHZ = 26.0f / 65536.0f / 1000.0f; // ~0.000397 MHz
    float zoomStep = scanStep * 0.25f;
    if (zoomStep < CC1101_MIN_STEP_MHZ) zoomStep = CC1101_MIN_STEP_MHZ;

    int zoomStepCount = (int)roundf((zoomEnd - zoomStart) / zoomStep) + 1;
    Serial.printf("[FREQ] Zoom pass: %.6f - %.6f MHz (%d steps, %.2f kHz each)\n",
                  zoomStart, zoomEnd, zoomStepCount, zoomStep * 1000.0f);

    for (float zfreq = zoomStart; zfreq <= zoomEnd + zoomStep * 0.5f; zfreq += zoomStep)
    {
      FEED_WDT();
      if (!cc1101_init(zfreq)) break;
      delay(50);
      struct tmeter_data zdata = get_meter_data();
      Serial.printf("[FREQ] Zoom %.6f MHz: RSSI=%d dBm, reads=%d\n",
                    zfreq, zdata.rssi_dbm, zdata.reads_counter);
      if (zdata.reads_counter > 0)
      {
        bestFreq = zfreq;
        bestRSSI = zdata.rssi_dbm;
        Serial.printf("[FREQ] Zoom locked at %.6f MHz: RSSI=%d dBm\n", zfreq, zdata.rssi_dbm);
        break;
      }
      wifiSerialLoop();
    }

    float offset = bestFreq - baseFreq;
    Serial.printf("[FREQ] Deep scan complete! Best frequency: %.6f MHz (offset: %.6f MHz, RSSI: %d dBm)\n",
                  bestFreq, offset, bestRSSI);

    saveFrequencyOffset(offset);

    char freqBuffer[16];
    snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", offset * 1000.0); // Convert MHz to kHz
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
    mqtt.publish(topicBuffer, freqBuffer, true);

    char statusMsg[128];
    snprintf(statusMsg, sizeof(statusMsg), "Deep scan complete: offset %.3f kHz", offset * 1000.0);
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
    mqtt.publish(topicBuffer, statusMsg, true);

    cc1101_init(bestFreq);
  }
  else
  {
    Serial.println("[FREQ] Deep scan failed - no meter signal found!");
    Serial.println("[FREQ] Please check:");
    Serial.println("[FREQ]  1. Meter is within range (< 50m typically)");
    Serial.println("[FREQ]  2. Antenna is connected to CC1101");
    Serial.println("[FREQ]  3. Meter serial/year are correct in private.h");
    Serial.println("[FREQ]  4. Current time is within meter's wake hours");
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
    mqtt.publish(topicBuffer, "Deep scan failed - check setup", true);
    cc1101_init(baseFreq);
  }

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "Idle" : "Not Connected", true);
}

// Function: adaptiveFrequencyTracking
// Description: Uses FREQEST register to adaptively adjust frequency offset over time
//              Accumulates frequency error estimates and adjusts when threshold is reached
void adaptiveFrequencyTracking(int8_t freqest)
{
  // FREQEST is a two's complement value representing frequency offset
  // Resolution is approximately Fxosc/2^14 ≈ 1.59 kHz per LSB (for 26 MHz crystal)
  const float FREQEST_TO_MHZ = 0.001587; // Conversion factor: ~1.59 kHz per LSB

  // Accumulate the frequency error
  float freqErrorMHz = (float)freqest * FREQEST_TO_MHZ;
  cumulativeFreqError += freqErrorMHz;
  successfulReadsBeforeAdapt++;

  Serial.printf("[FREQ] FREQEST: %d (%.4f kHz error), cumulative: %.4f kHz over %d reads\n",
                freqest, freqErrorMHz * 1000, cumulativeFreqError * 1000, successfulReadsBeforeAdapt);

  // Only adapt after N successful reads to avoid over-correcting on noise
  if (successfulReadsBeforeAdapt >= ADAPT_THRESHOLD)
  {
    float avgError = cumulativeFreqError / ADAPT_THRESHOLD;

    // Only adjust if average error is significant (> 2 kHz)
    if (abs(avgError * 1000) > 2.0)
    {
      Serial.printf("[FREQ] Adaptive adjustment: average error %.4f kHz over %d reads\n",
                    avgError * 1000, ADAPT_THRESHOLD);

      // Adjust the stored offset (apply 50% of the measured error to avoid over-correction)
      float adjustment = avgError * 0.5;
      storedFrequencyOffset += adjustment;

      Serial.printf("[FREQ] Adjusting frequency offset by %.6f MHz (new offset: %.6f MHz)\n",
                    adjustment, storedFrequencyOffset);

      saveFrequencyOffset(storedFrequencyOffset);

      char freqBuffer[16];
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", storedFrequencyOffset * 1000.0); // Convert MHz to kHz
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
      mqtt.publish(topicBuffer, freqBuffer, true);

      // Reinitialize CC1101 with adjusted frequency
      cc1101_init(FREQUENCY + storedFrequencyOffset);
    }
    else
    {
      Serial.printf("[FREQ] Frequency stable (avg error %.4f kHz < 2 kHz threshold)\n", avgError * 1000);
    }

    // Reset accumulators
    cumulativeFreqError = 0.0;
    successfulReadsBeforeAdapt = 0;
  }
}

/**
 * @brief Validate configuration parameters
 *
 * Performs startup validation of configuration parameters to fail fast
 * on invalid settings. Checks:
 * - METER_CODE (must parse to non-zero serial within 24-bit protocol limit)
 * - FREQUENCY (must be 300-500 MHz if defined)
 * - READING_HOUR/MINUTE (must be valid time)
 * - Reading schedule string format
 *
 * Logs validation results to serial console with ✓ or ERROR markers.
 *
 * @return true if all validations passed, false if any parameter is invalid
 */
bool validateConfiguration()
{
  bool valid = true;
  uint8_t parsed_year = 0;
  uint32_t parsed_serial = 0;

  Serial.println("\n=== Configuration Validation ===");

